<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<!--
lotux_de.html
16.03.2002

This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 2 of the License, or
(at your option) any later version.

Copyright (C) 2001-2002 by Carsten Moldenauer and Martin Huschenbett
-->
<html>
<head>
	<title>Lotux</title>
</head>
<body>
	<h1 align="center"><b>Lotux</b></h1>
	<h3 align="center">Ein Computerspiel in Anlehnung an das Taktikspiel
		<em>Lotus</em> vom Ravensburger Verlag</h3>
	<h2>Spielregeln</h2>
	<p>
		Die Spielregeln k&ouml;nnen unter <em>Hilfe/Wie man Lotus spielt</em>
		nachgelesen werden.
	</p>
	<h2>Spieltypen</h2>
	<p>
		Einerseits kann man zu zweit an einem Computer gegeneinander spielen
		(<em>Lokales Spiel</em>) oder mit anderen Leuten &uuml;ber ein Netzwerk
		(z.B. Intranet oder Internet) spielen (<em>Netzwerkspiel</em>).
	</p>
	<p>
		Ein Modus in dem man sich dem Computer messen kann ist momentan noch in
		Entwicklung.
	</p>
	<h2>Wie man ein neues Spiel startet</h2>
	<p>
		Um ein neues Spiel zu starten, sollte man sich im Men&uuml;
		<em>Optionen</em> zun&auml;chst f&uuml;r einen Spieltyp entscheiden.
		Anschlie&szlig;end muss man im <em>Spiel</em>-Menu den Punkt
		<em>Neues Spiel</em> ausw&auml;hlen. Hat man sich f&uuml;r ein
		<em>Netzwerkspiel</em> entschieden, muss man gegebenfalls noch auf
		einen Mitspieler warten.
	</p>
	<h2>Wie man seine Steine r&uuml;ckt</h2>
	<p>
		Hat man sich einen Stapel ausgesucht, dessen obersten Stein man ziehen
		m&ouml;chte, dann gen&uuml;gt ein Mausklick auf diesen, um den Stein
		zu bewegen. Klickt man aus Versehen auf einen Stein des Gegners,
		wird dies einfach ignoriert.
	</p>
	<p>
		Will man einen Stein von einem Startfeld ziehen, erscheint unter
		Umst&auml;nden ein Dialog, in dem man gefragt wird, ob man seinen
		Stein links oder rechts einsetzen will. An dieser Stelle muss man sich
		f&uuml;r eine der beiden Richtungen entscheiden. W&auml;hlt man links,
		wird der Stein auf dem linken Teilarm des Spielfelds (durch ein
		<em>L</em> markiert) platziert. Enscheidet man sich hingegen f&uuml;r
		rechts, wird der Stein auf den rechten Arm (durch ein <em>R</em>
		gekennzeichnet) gestellt.
	</p>
	<p>
		Kann man das Spielfeld nicht richtig &uuml;berblicken oder seinen
		gew&uuml;nschten Stapel nicht anklicken, da sich bestimmte Haufen
		gegenseitig verdecken, hat man die M&ouml;glichkeit mit Hilfe der
		Pfeiltasten oder der Maus (einfach die linke Taste festhalten und
		die Maus bewegen) drehen.
	</p>
	<h2>Das lokale Spiel</h2>
	<p>
		Hat man sich f&uuml;r ein lokales Spiel entschieden und ein solches
		gestartet, darf der Besitzer der schwarzen Steine den ersten Zug
		durchf&uuml;hren. Danach l&auml;uft das Spiel wie in der
		Spielbeschreibung erkl&auml;rt ab.
	</p>
	<p>
		Falls man einmal den &Uuml;berblick verloren haben sollte und nicht mehr
		wei&szlig;, wer gerade an der Reihe ist, erweist sich der Hinweis in der
		Statuszeile gewiss als sehr n&uuml;tzlich.
	</p>
	<h2>Das Netzwerkspiel</h2>
	<p>
		Nachdem ein Netzwerkspiel gestartet hat, versucht das Programm sich
		mit dem eingestellten Server (siehe Abschnitt <em>Einstellungen</em>)
		zu Verbinden. Ist dies aus nicht m&ouml;glich, wird der Vorgang mit
		einer Fehlermeldung beendet. Wurde die Verbindung zum Server erfolgreich
		hergestellt, kann das Spiel auch schon fast beginnen. Man muss jedoch
		gegebenfalls noch ein wenig Geduld haben und auf einen Mitspieler warten.
	</p>
	<p>
		Wurde die Verbindung zum Server erfolgreich eingerichtet und es hat
		sich auch ein Mitspieler gefunden, werden zun&auml;chst die Namen der
		Spieler ausgetauscht, d.h. Sie erfahren den Namen ihres Gegners.
		Anschlie&szlig;end legt der Server die Farben beider Spieler fest und
		und teilt sie diesen mit. Haben Sie die schwarzen Steine, d&uuml;rfen
		Sie den ersten Zug durchf&uuml;hren, andernfalls hat ihr Kontrahent
		dieses Privileg. In der Statuszeile werden Sie zus&auml;tzlich stets
		dar&uuml;ber informiert, wer gerade an der Reihe ist.
	</p>
	<h2>Einstellungen</h2>
	<p>
		&Uuml;ber den Men&uuml;punkt <em>Optionen/Einstellungen</em> haben Sie
		verschiedene M&ouml;glichkeiten, ihr Programm zu konfigurieren.
	</p>
	<p>
		Zun&auml;chst k&ouml;nnen Sie die Sprache der Anwendung einstellen.
		&Auml;nderungen werden jedoch erst nach einem Neustart des Programms
		&uuml;bernommen.
	</p>
	<p>
		Weiterhin haben Sie die Chance den Suchpfad des Programms zu wechseln.
		In diesem Verzeichnis wird nach den &Uuml;bersetzungs- und den
		Hilfedateien gesucht (in den Unterverzeichnissen <em>lang</em> und
		<em>help</em>). Wenn die Anwendung normal installiert wurde, m&uuml;ssen
		Sie keine &Auml;nderungen an dieser Einstellung vornehmen, was sich
		hingegen als sinnvoll erweist, wenn sich diese Dateien in Ihrem
		Homeverzeichnis befinden.
	</p>
	<p>
		Im Register <em>Identit&auml;t</em> haben Sie die M&ouml;glichkeit
		Ihren Namen und Ihre E-Mail-Adresse anzugeben. Diese werden dann bei
		jedem Netzwerkspiel an Ihren Gegner &uuml;bermittelt.
	</p>
	<p>
		Im Register <em>Server</em> k&ouml;nnen Sie den Server, auf dem Sie
		Ihre Netzwerkspiele durchf&uuml;hren wollen einstellen. Weiterhin
		ist es m&ouml;glich den Port auf dem der Server l&auml;uft zu
		ver&auml;ndern. Der Standardwert f&uuml;r diese Option ist <em>5180</em>.
	</p>
	<h2>Wo kann man im Internet Lotus spielen?</h2>
	<p>
		Auf <em>lotux.homelinux.org</em> l&auml;uft tags&uuml;ber (MEZ) ein
		Server. Weiterhin befindet sich unter
		<em>http://lotux.homelinux.org/</em> eine Liste mit anderen Servern.
	</p>
	<h2>Wie kann man Kontakt zu den Autoren aufnehmen?</h2>
	<p>
		Im Internet sind wir unter <em>http://lotux.homelinux.org/</em>
		anzutreffen. Weiterhin k&ouml;nnen Sie uns eine E-Mail an
		<em>spieltheorie@gmx.de</em> schicken.
	</p>
	<br>
	<br>
	<center>
		<b>Copyright</b><br>
		(C) 2001-2002 by Carsten Moldenhauer and Martin Huschenbett
	</center>
</body>
